//"use strict"

console.log('number' + 3 + 3); // буде сума рядка і числа number33
console.log(null + 3); // нуль плюс три буде 3
console.log(5 && "qwerty"); // число "і" стрінга, виведе 5 бо, якщо перше знаяення true виводить те що справа
console.log(+'40' + +'2' + "hillel"); // плюс перетворює стрінгу на намберб результат сумування намбера і стрінги буде стрінга 42hillel
console.log('10' - 5 === 6); // стрінга стане набером, далі математична дія віднімання, а потім порівняння строгої відповідності, результат буде false
console.log(true + false); // математична дія 1 + 0, результатом буде 1
console.log('4px' - 3); //відняти число від стрінги неможливо, результатом буде помилка чи NaN
console.log('4' - 3); // стрінга стає числом математична дія, результат 1
console.log('6' + 3 ** 0); // дія множення перша ніж додавання, число в нульовому ступені дорівнює 1, далі стрінга плюс число дає стрінгу 61, але я б порахувала як 7, консоль рахує інакше
console.log(12 / '6'); // стрінга стала числом, виконалося ділення, результат 2
console.log('10' + (5 === 6)); // відбулося обʼєднання, дія в дужках в пріорітеті, не було строгої відповідності тому false, а далі стрінга + стрінга = 10false
console.log(null == ''); // нуль (порожне) не дорівнює відсутньому значенню, тому false
console.log(3 ** (9 / 3)); // дія в дужках в пріорітеті це ділення, а потім приведення до ступреня, результат 27
console.log(!!'false' == !!'true'); // зламала голову, щоб зрозуміти, що значення булінь хоч і перевертаються, але дають результат true
console.log(0 || '0' && 1); // і пріорітетніше над або, '0' стрінга не порожня тому це true повертає правий 1, далі при порівнянні 0 є false, а значить повертає праве 1
console.log((+null == false) < 1); // нулл стає 0, що ріне до false, тому результат порівняння 0 і false ми отримуємо true, що дорівнює 1, true не може бути менше 1, результат задачі false
console.log(false && true || true); // задача на порівння, спочатку і результат лівий false, потім false i true, виводиться результат правий true
console.log(false && (false || true)); // починаємо з дужок, перший неправдивий, тому виводимо правий true, в наступному порівння перший неправдивий, тому результат false все заледить від того, ми порівнюємо як і чи як або
console.log((+null == false) < 1 ** 5); // першу частину як +null == false стає true описано вище, 1 в пʼятому ступені стає 1, а true не може бути менше 1, тому результат false