"use strict"
function checkProbabilityTheory(count) {
    let evenCount = 0;
    let oddCount = 0;

    for (let i = 0; i < count; i++) {
        let randomNum = Math.floor(Math.random() * (1000 - 100 + 1)) + 100;

        if (randomNum % 2 === 0) {
            evenCount++;
        } else {
            oddCount++;
        }
    }

    let evenPercent = (evenCount / count * 100);
    let oddPercent = (oddCount / count * 100);

    console.log("Кількість згенерованих чисел:", count);
    console.log("Парних чисел:", evenCount);
    console.log("Непарних чисел:", oddCount);
    console.log("Відсоток парних до непарних:");
    console.log("Парні:", evenPercent + "%");
    console.log("Непарні:", oddPercent + "%");
}

checkProbabilityTheory(100);
checkProbabilityTheory(50);
checkProbabilityTheory(80);

/* На початку задаю функціяю в середині якої лежить змінна count
через let лічильникам парних і непарних чисел даю початкове значення 0
описую цикл для підрахунку. лік відбувається до поки значення i буде меншим за значення count
використовую метод при якому значення числа завжи буде цілим для операції рандомізації числа
по задачі у нас діапазон від 100 до 1000, а одиничку додаю бу інакше рандом буде від 100 до 901, щоб 
отримати 1000 нам треба додати ще 100
Math.floor(Math.random() * (max - min + 1)) + min;
в циклі (я не знаю чому але хочеться додавати "нашому") є умови для підрахунку
якщо число ділиться на 2 без залишку (строга відповідність) це один каунтер
якщо при діленні залишок є це другий каунтер
рахуємо відсотки парних і не парних чисел
виводимо результати в консоль
викликаємо функцію де значення 100 це скільки разів я хочу щоб генерувалось випадкове число
перевіряти 100 відсоткіів то стандартна історія
з цікавості додаю, що буде при 50 чи 80
*/